# -*- coding: utf-8 -*-
class basic_data:
	def __init__(self):
		pass

	def basic_data(self):
		common_data = {}

		#기본 색스타일을 기본스타일로 변경하는 것이다
		#자주 사용하는 색의 이름을 기본색 이름으로 변경하는 것이다


		common_data["check_excel_color_no"] = {
			"검정": 1,	"흰": 2, "빨강": 3, "파랑": 5, "노랑": 6,
			"핑크": 7, "오렌지": 46, "보라": 13, "청록": 14, "옅은노랑": 19,
			"옅은하늘": 20, "매실": 18, "밝은하늘": 8, "연두": 4, "회색20": 15,
			"회색40": 48, "회색60": 16, "회색80": 56, "진한적색": 9, "진한녹색": 10,
			"진한청색": 11, "진한황": 12, "진한보라": 21, "진한하늘": 33, "진한산호색": 49,
			"담자색": 17, "토황": 45, "취람": 35, "송화": 36, "두록": 40,
			"주색": 22, "청현": 23, "회보라": 24, "밝은벽청색": 37, "선홍": 38, "치색": 47,
		}

		common_data["color_mode"] = ["단색조합", "등간격 3색 조화", "보색", "인접색", "근접보색조합","고명도배색","고명도배색+약간더 부드러운 이미지","중명도배색",
		                             "중명도배색+약간더 부드러운 이미지","저중명도배색", "저명도배색+약간더 어두운 이미지","명도차가 큰 배색",
		                             "명도차가 큰 배색 + 근접보색","고채도 배색","채도차가 큰 배색","저채도 배색",]

		common_data["pccs_eng"] = ["vivid", "bright", "strong", "deep", "light", "soft", "dull", "dark", "pale", "lightgrayish", "grayish", "darkgrayish"]
		common_data["pccs_kor"] = ["파스텔", "연한", "밝은", "흐린", "선명한", "기본", "탁한", "진한", "어두운", "회색", "검은", "검정"]

		common_data["pccs_slno"] = [[90, 50], [80, 30], [80, 50], [80, 70], [50, 20], [50, 40], [50, 60], [50, 80], [20, 20], [20, 40], [20, 60], [20, 80]]


		common_data["s_step"] = {"1": [10], "2": [20], "3": [30], "4": [40],"5": [50], "6": [60], "7": [70], "8": [80], "9": [90], }

		common_data["l_step"] = {"1": [10], "2": [20], "3": [30], "4": [40],"5": [50], "6": [60], "7": [70], "8": [80], "9": [90], }

		common_data["sl_step_small"] = {"1": [0, 12], "2": [0, 9], "3": [0, 6], "4": [0, 3], "5": [0, 0], "6": [0, -3], "7": [0, -6], "8": [0, -9], "9": [0, -12], "0": [0, -14],}

		common_data["sl_step"] = {"1": [100, 80], "2": [100, 77], "3": [100, 68], "4": [100, 59], "5": [100, 50], "6": [90, 41], "7": [80, 32], "8": [70, 23], "9": [60, 14] }

		common_data["pccs_name"] = ["v", "b", "s", "dp", "lt", "sf", "d", "dk", "p", "ltg", "g", "dkg"]

		common_data["color_kor"] = ["빨강", "주황", "노랑", "연두", "초록", "연초록", "옥색", "청록", "파랑", "남색", "보라", "자홍", "회색", "흰색", "검정", "분홍"]

		common_data["color_eng"] = ["red", "orange", "yellow", "greenyellow", "green", "greencyan", "cyan", "bluecyan", "blue", "bluemagenta", "magenta", "redmagenta", "gray", "white", "black"]

		common_data["pccs_slno"] = [[90, 50], [80, 30], [80, 50], [80, 70], [50, 20], [50, 40], [50, 60], [50, 80], [20, 20], [20, 40], [20, 60], [20, 80]]



		common_data["dic_color_index"] = {"red":0, "ora":1, "yel":2, "yg":3, "gre":4, "gc":5, "cya":6, "cb":7, "blu":8, "bm":9, "mag":10, "mr":11, "gra":12, "whi":13, "bla":14}

		common_data["line_thickness_dic"] = {"hairline": 1, "basic": -4138, "thick": 4, "thin": 2,"t-2": 1, "t0": -4138, "t1": 4, "t-1": 2, "매우가는선": 1, "일반": -4138, "굵은선": 4, "가는선": 2,}

		common_data["line_position_dic"] = {"/": 6, "\\": 5, "left": 7, "top": 8, "bottom": 9, "right": 10, "inside-h": 11, "inside-v": 12, "대각선오른쪽": 6, "대각선왼쪽": 5, "왼쪽": 7, "위쪽": 8, "아래쪽": 9, "오른쪽": 10, "안쪽세로": 11, "안쪽가로": 12, }

		common_data["line_type_dic"] = {"basic": 1, "-": -4115, "-.": 4, "-..": 5, ".": -4118, "=": -4119, "no": -4142, "/.": 13, "실선": 1, "점선": 2, "가는점선": 1, "굵은실선": 6, }

		common_data["h_no_by_color_name"] = {"red": 0, "ora": 30, "yel": 60, "gy": 90, "gre": 120, "gc": 150 , "cya": 180, "bc": 210, "blu": 240, "bm": 270, "mag": 300, "rm": 330, "gra": 0, "whi": 0, "bla": 0, }

		#common_data["dic_num_slstep_small"] = {"1": [0, 12], "2": [0, 9], "3": [0, 6], "4": [0, 3], "5": [0, 0], "6": [0, -3], "7": [0, -6], "8": [0, -9], "9": [0, -12], "0": [0, -14],}
		#common_data["dic_num_slstep"] = {"1": [100, 80], "2": [100, 77], "3": [100, 68], "4": [100, 59], "5": [100, 50], "6": [90, 41], "7": [80, 32], "8": [70, 23], "9": [60, 14] }

		#common_data["short_color_name_eng"] = ["r", "o", "y", "gy", "g", "gc", "c", "bc", "b", "bm", "m", "rm", "g", "w", "bl"]

		common_data["list_colorstyle_eng"] = ["white", "pale", "light", "soft", "vivid", "dull", "deep", "dark", "black", "gray"]



		common_data["list_basic_12rgb"] = [[255, 0, 0],[255, 128, 0],[255, 255, 0],[128, 255, 0],
										[0, 255, 0],[0, 255, 128],[0, 255, 255],[0, 128, 255],
										[0, 0, 255],[128, 0, 255],[255, 0, 255],[255, 0, 128],]



		common_data["list_basic_12h"] = [0, 30, 60, 90, 120, 150, 180, 210, 240, 270, 300, 330]

		common_data["list_basic_10sl"] = [[100, 0], [90, 10], [80, 20], [70, 30],  [60, 40], [50, 50], [40, 60], [30, 70], [10, 80], [10, 90], [0, 100]]

		common_data["list_basic_11sl"] = [[100, 0], [100, 10], [100, 20], [100, 30], [100, 40], [100, 50], [100, 60], [100, 70], [100, 80],  [100, 90], [100, 100]]

		common_data["list_basic_12colorstyle"] = [[90, 50], [80, 30], [80, 50], [80, 70], [50, 20], [50, 40], [50, 60], [50, 80], [20, 20], [20, 40], [20, 60], [20, 80]]

		# 기본 색스타일을 기본스타일로 변경하는 것이다


		# 자주 사용하는 색의 이름을 기본색 이름으로 변경하는 것이다

		common_data["dic_colorname_hnum"] = {"red": 0, "ora": 30, "yel": 60, "gy": 90, "gre": 120, "gc": 150 , "cya": 180, "bc": 210, "blu": 240, "bm": 270, "mag": 300, "rm": 330, "gra": 0, "whi": 0, "bla": 0, }

		common_data["dic_colornum_colorname_forexcel"] = {
			1: "검정색", 2: "흰색", 3: "빨강색", 5: "파랑색", 6: "노랑색",
			7: "핑크색", 46: "오렌지", 13: "보라색", 14: "청록색", 19: "옅은노랑",
			20: "옅은하늘", 18: "매실색", 8: "밝은하늘", 4: "연두색", 15: "회색20",
			48: "회색40", 16: "회색60", 56: "회색80", 9: "진한적색", 10: "진한녹색",
			11: "진한청색", 12: "진한황색", 21: "진한보라", 33: "진한하늘", 49: "진한산호색",
			17: "담자색", 45: "토황색", 35: "취람색", 36: "송화색", 40: "두록색",
			22: "주색", 23: "청현색", 24: "회보라색", 37: "밝은벽청색", 38: "선홍색", 47: "치색",
		}

		common_data["color_dic"] = {
			'황갈색': ['일반색', '브라운 색상', '', '# D2B48C', '210180140', ''],
			'검정': ['일반색', '', 'black', '#000000', '', ''],
			'해군': ['일반색', '', 'navy', '#000080', '', ''],
			'푸른': ['일반색', '', 'blue', '#0000ff', '', ''],
			'초록': ['일반색', '', 'green', '#008000', '', ''],
			'물오리': ['일반색', '', 'teal', '#008080', '', ''],
			'라임': ['일반색', '', 'lime', '#00ff00', '', ''],
			'아쿠아': ['일반색', '', 'aqua', '#00ffff', '', ''],
			'청록색': ['일반색', '', 'cyan', '#00ffff', '', ''],
			'숲': ['일반색', '', 'forestgreen', '#228b22', '', ''],
			'해록': ['일반색', '', 'seagreen', '#2e8b57', '', ''],
			'미디엄': ['일반색', '', 'mediumseagreen', '#3cb371', '', ''],
			'터키 옥': ['일반색', '', 'turquoise', '#40e0d0', '', ''],
			'남빛': ['일반색', '', 'indigo', '#4b0082', '', '1'],
			'잔디밭': ['일반색', '', 'lawngreen', '#7cfc00', '', ''],
			'연두빛': ['일반색', '', 'chartreuse', '#7fff00', '', '1'],
			'남옥': ['일반색', '', 'aquamarine', '#7fffd4', '', ''],
			'적갈색': ['일반색', '', 'maroon', '#800000', '', '1'],
			'보라색': ['일반색', '', 'purple', '#800080', '', ''],
			'올리브': ['일반색', '', 'olive', '#808000', '', '1'],
			'회색': ['일반색', '', 'gray', '#808080', '', ''],
			'연두색': ['일반색', '', 'yellowgreen', '#9acd32', '', '1'],
			'시에나': ['일반색', '', 'sienna', '#a0522d', '', ''],
			'갈색': ['일반색', '', 'brown', '#a52a2a', '', '1'],
			'하늘색': ['일반색', '', 'lightblue', '#add8e6', '', ''],
			'팔레트': ['일반색', '', 'paleturquoise', '#afeeee', '', ''],
			'은': ['일반색', '', 'silver', '#c0c0c0', '', ''],
			'인디언': ['일반색', '', 'indianred', '#cd5c5c', '', '1'],
			'페루': ['일반색', '', 'peru', '#cd853f', '', ''],
			'초콜릿': ['일반색', '', 'chocolate', '#d2691e', '', '1'],
			'난초': ['일반색', '', 'orchid', '#da70d6', '', '1'],
			'진홍': ['일반색', '', 'crimson', '#dc143c', '', '1'],
			'자두': ['일반색', '', 'plum', '#dda0dd', '', '1'],
			'라벤더': ['일반색', '', 'lavender', '#e6e6fa', '', ''],
			'제비꽃': ['일반색', '', 'violet', '#ee82ee', '', ''],
			'창백한': ['일반색', '', 'palegoldenrod', '#eee8aa', '', ''],
			'단물': ['일반색', '', 'honeydew', '#f0fff0', '', ''],
			'하늘빛': ['일반색', '', 'azure', '#f0ffff', '', ''],
			'밀': ['일반색', '', 'wheat', '#f5deb3', '', ''],
			'베이지': ['일반색', '', 'beige', '#f5f5dc', '', ''],
			'연기': ['일반색', '', 'whitesmoke', '#f5f5f5', '', ''],
			'크롬': ['일반색', '', 'chrome', '#F7E600', '', ''],
			'연어': ['일반색', '', 'salmon', '#fa8072', '', ''],
			'리넨': ['일반색', '', 'linen', '#faf0e6', '', ''],
			'빨간': ['일반색', '', 'red', '#ff0000', '', ''],
			'마젠타': ['일반색', '', 'magenta', '#ff00ff', '', ''],
			'오렌지레드': ['일반색', '', 'orangered', '#ff4500', '', ''],
			'토마토': ['일반색', '', 'tomato', '#ff6347', '', ''],
			'푹샤': ['일반색', '', 'fuchsia', '#ff77ff', '', ''],
			'산호': ['일반색', '', 'coral', '#ff7f50', '', ''],
			'등불': ['일반색', '', 'lightsalmon', '#ffa07a', '', ''],
			'주황색': ['일반색', '', 'orange', '#ffa500', '', '1'],
			'연분홍': ['일반색', '', 'lightpink', '#ffb6c1', '', '1'],
			'분홍': ['일반색', '', 'pink', '#ffc0cb', '', ''],
			'금': ['일반색', '', 'gold', '#ffd700', '', ''],
			'복숭아': ['일반색', '', 'peachpuff', '#ffdab9', '', '1'],
			'모카신': ['일반색', '', 'moccasin', '#ffe4b5', '', ''],
			'비스크': ['일반색', '', 'bisque', '#ffe4c4', '', ''],
			'파파야': ['일반색', '', 'papayawhip', '#ffefd5', '', ''],
			'조개': ['일반색', '', 'seashell', '#fff5ee', '', ''],
			'눈': ['일반색', '', 'snow', '#fffafa', '', ''],
			'노랑': ['일반색', '', 'yellow', '#ffff00', '', ''],
			'연노랑': ['일반색', '', 'lightyellow', '#ffffe0', '', '1'],
			'상아': ['일반색', '', 'ivory', '#fffff0', '', ''],
			'하얀': ['일반색', '', 'white', '#ffffff', '', ''],
			'담청색': ['한국 전통색상', '청록색계', '', '#00A6A9', '', ''],
			'벽색': ['한국 전통색상', '청록색계', '', '#00B5E3', '', ''],
			'진초록색': ['한국 전통색상', '청록색계', '', '#0A8D5E', '', ''],
			'청색': ['한국 전통색상', '청록색계', '', '#0B6DB7', '', '1'],
			'흑청색': ['한국 전통색상', '청록색계', '', '#1583AF', '', ''],
			'명록색': ['한국 전통색상', '청록색계', '', '#16AA52', '', ''],
			'청벽색': ['한국 전통색상', '청록색계', '', '#18B4E9', '', ''],
			'초록색': ['한국 전통색상', '청록색계', '', '#1C9249', '', '1'],
			'흑백': ['한국 전통색상', '무채색계', '', '#1D1E23', '', ''],
			'흑록색': ['한국 전통색상', '청록색계', '', '#2E674E', '', ''],
			'양록색': ['한국 전통색상', '청록색계', '', '#31B675', '', ''],
			'청자색': ['한국 전통색상', '자색계', '', '#403F95', '', '1'],
			'벽청색': ['한국 전통색상', '청록색계', '', '#448CCB', '', ''],
			'숙람색': ['한국 전통색상', '청록색계', '', '#45436C', '', ''],
			'다자색': ['한국 전통색상', '자색계', '', '#47302E', '', ''],
			'군청색': ['한국 전통색상', '청록색계', '', '#4F599F', '', ''],
			'유청색': ['한국 전통색상', '청록색계', '', '#569A49', '', ''],
			'천청색': ['한국 전통색상', '청록색계', '', '#5AC6D0', '', ''],
			'삼청색': ['한국 전통색상', '청록색계', '', '#5C6EB4', '', ''],
			'포도색': ['한국 전통색상', '자색계', '', '#5D3462', '', '1'],
			'취람색': ['한국 전통색상', '청록색계', '', '#5DC19B', '', ''],
			'벽람색': ['한국 전통색상', '청록색계', '', '#6979BB', '', ''],
			'남색': ['한국 전통색상', '청록색계', '', '#6A5BA8', '', '1'],
			'유록색': ['한국 전통색상', '청록색계', '', '#6AB048', '', ''],
			'양람색': ['한국 전통색상', '청록색계', '', '#6C71B5', '', ''],
			'자색': ['한국 전통색상', '자색계', '', '#6D1B43', '', '1'],
			'연지회색': ['한국 전통색상', '무채색계', '', '#6F606E', '', ''],
			'비색': ['한국 전통색상', '청록색계', '', '#72C6A5', '', '1'],
			'홍람색': ['한국 전통색상', '자색계', '', '#733E7F', '', ''],
			'연람색': ['한국 전통색상', '청록색계', '', '#7963AB', '', ''],
			'벽자색': ['한국 전통색상', '자색계', '', '#84A7D3', '', '1'],
			'자주색': ['한국 전통색상', '자색계', '', '#89236A', '', '1'],
			'석간주색': ['한국 전통색상', '붉은색', '', '#8A4C44', '', ''],
			'흑홍색': ['한국 전통색상', '붉은색', '', '#8E6F80', '', ''],
			'구색': ['한국 전통색상', '무채색계', '', '#959EA2', '', ''],
			'토색': ['한국 전통색상', '황색계', '', '#9A6B31', '', ''],
			'옥색': ['한국 전통색상', '청록색계', '', '#9ED6C0', '', '1'],
			'적토색': ['한국 전통색상', '붉은색', '', '#9F494C', '', ''],
			'회보라색': ['한국 전통색상', '자색계', '', '#B3A7CD', '', ''],
			'적색': ['한국 전통색상', '붉은색', '', '#B82647', '', '1'],
			'적자색': ['한국 전통색상', '자색계', '', '#BA4160', '', ''],
			'자황색': ['한국 전통색상', '황색계', '', '#BB9E8B', '', ''],
			'호박색': ['한국 전통색상', '붉은색', '', '#BD7F41', '', '1'],
			'연지색': ['한국 전통색상', '붉은색', '', '#BE577B', '', '1'],
			'담자색': ['한국 전통색상', '자색계', '', '#BEA3C9', '', ''],
			'진홍색': ['한국 전통색상', '붉은색', '', '#BF2F7B', '', '1'],
			'주홍색': ['한국 전통색상', '붉은색', '', '#C23352', '', '1'],
			'추향색': ['한국 전통색상', '붉은색', '', '#C38866', '', ''],
			'토황색': ['한국 전통색상', '황색계', '', '#C8852C', '', ''],
			'주색': ['한국 전통색상', '붉은색', '', '#CA5E59', '', ''],
			'춘유록색': ['한국 전통색상', '청록색계', '', '#CBDD61', '', ''],
			'선홍색': ['한국 전통색상', '붉은색', '', '#CE5A9E', '', '1'],
			'지황색': ['한국 전통색상', '황색계', '', '#D6B038', '', ''],
			'육색': ['한국 전통색상', '붉은색', '', '#D77964', '', ''],
			'소색': ['한국 전통색상', '무채색계', '', '#D8C8B2', '', ''],
			'훈색': ['한국 전통색상', '붉은색', '', '#D97793', '', ''],
			'진분홍색': ['한국 전통색상', '붉은색', '', '#DB4E9C', '', '1'],
			'홍황색': ['한국 전통색상', '황색계', '', '#DDA28F', '', ''],
			'설백색': ['한국 전통색상', '무채색계', '', '#DDE7E7', '', ''],
			'연분홍색': ['한국 전통색상', '붉은색', '', '#E0709B', '', '1'],
			'장단색': ['한국 전통색상', '붉은색', '', '#E16350', '', ''],
			'분홍색': ['한국 전통색상', '붉은색', '', '#E2A6B4', '', '1'],
			'지배색': ['한국 전통색상', '무채색계', '', '#E3DDCB', '', ''],
			'두록색': ['한국 전통색상', '황색계', '', '#E5B98F', '', ''],
			'유배색': ['한국 전통색상', '무채색계', '', '#E7E6D2', '', '1'],
			'담주색': ['한국 전통색상', '붉은색', '', '#EA8474', '', ''],
			'유황색': ['한국 전통색상', '황색계', '', '#EBBC6B', '', '1'],
			'적황색': ['한국 전통색상', '황색계', '', '#ED9149', '', '1'],
			'홍색': ['한국 전통색상', '붉은색', '', '#F15B5B', '', '1'],
			'행황색': ['한국 전통색상', '황색계', '', '#F1A55A', '', ''],
			'담황색': ['한국 전통색상', '황색계', '', '#F5F0C5', '', ''],
			'치자색': ['한국 전통색상', '황색계', '', '#F6CF7A', '', '1'],
			'송화색': ['한국 전통색상', '황색계', '', '#F8E77F', '', ''],
			'황색': ['한국 전통색상', '황색계', '', '#F9D537', '', ''],
			'명황색': ['한국 전통색상', '황색계', '', '#FEE134', '', ''],
			'백색': ['한국 전통색상', '무채색계', '', '#FFFFFF', '', ''],
			'개나리색': ['일반색', '', '', '', '247,230,0', ''],
			'구리색': ['일반색', '', '', '', '160,83,75', '1'],
			'다홍': ['일반색', '', '', '', '255,36,0', ''],
			'대양색': ['일반색', '', '', '', '0,119,190', ''],
			'데님': ['일반색', '', '', '', '21,96,189', '1'],
			'라임색': ['일반색', '', '', '', '191,255,0', ''],
			'민트': ['일반색', '', '', '', '62180137', ''],
			'바다색': ['일반색', '', '', '', '0,128,255', '1'],
			'보라': ['일반색', '', '', '', '112,93,168', '1'],
			'빨강': ['일반색', '', '', '', '237,26,61', '1'],
			'살구색': ['일반색', '', '', '', '251206177', '1'],
			'상아색': ['일반색', '', '', '', '238230196', '1'],
			'셀레스테': ['일반색', '', '', '', '178255255', ''],
			'스코벨로프': ['일반색', '', '', '', '0,122,116', ''],
			'아이보리': ['일반색', '', '', '', '236230204', '1'],
			'야생수박색': ['일반색', '', '', '', '252108133', ''],
			'좀프': ['일반색', '', '', '', '57167142', ''],
			'카민': ['일반색', '', '', '', '201,71,79', ''],
			'파랑': ['일반색', '', '', '', '0,153,255', '1'],
			'황토색': ['일반색', '', '', '', '198,138,18', '1'],
		}

		common_data["알파벳"] = "abcdefghijklmnopqrstuvwxyz"
		common_data["자음"] = "ㄱㄴㄷㄹㅁㅂㅅㅇㅈㅊㅋㅌㅍㅎ"
		common_data["모음"] ="ㅏㅑㅓㅕㅗㅛㅜㅠㅡㅣ"
		common_data["가나다"] = "가나다라마바사아자차카타파하"
		common_data["숫자"]= "1234567890"
		common_data["그리스문자"]= "αβγδεζήθικλμνξόπρΣτ"
		common_data["로마숫자"] = "ⅠⅡⅢⅣⅤⅥⅦⅧⅨⅩ"
		common_data["원ㄱ"] = "㉠㉡㉢㉣㉤㉥㉦㉧㉨㉩㉪㉫㉬㉭"
		common_data["원가"] = "㉮㉯㉰㉱㉲㉳㉴㉵㉶㉷㉸㉹㉺㉻"
		common_data["원a"] = "ⒶⒷⒸⒹⒺⒻⒼⒽⒾⒿⓀⓁⓂⓃⓄⓅⓆⓇⓈⓉⓊⓋⓌⓍⓎⓏ"
		common_data["원1"] ="⓪①②③④⑤⑥⑦⑧⑨⑩⑪⑫⑬⑭⑮⑯⑰⑱⑲⑳㉑㉒㉓㉔㉕㉖㉗㉘㉙㉚㉛㉜㉝㉞㉟㊱㊲㊳㊴㊵㊶㊷㊸㊹㊺㊻㊼㊽㊾㊿"
		common_data["서수"] =['1ST', '2ND', '3RD', '4TH', '5TH', '6TH', '7TH', '8TH', '9TH', '10TH', '11TH', '12TH', '13TH', '14TH', '15TH', '16TH', '17TH', '18TH', '19TH', '20TH', '21ST', '22ND', '23RD', '24TH', '25TH', '26TH', '27TH', '28TH', '29TH', '30TH', '31ST']

		common_data["month_eng_short"] = ['JAN', 'FEB', 'MAR', 'APR', 'MAY', 'JUN', 'JUL', 'AUG', 'SEP', 'OCT', 'NOV', 'DEC']
		common_data["month_eng"] = ['JANUARY', 'FEBRUARY', 'MARCH', 'APRIL', 'MAY', 'JUNE', 'JULY', 'AUGUST', 'SEPTEMBER', 'OCTOBER','NOVEMBER', 'DECEMBER']
		common_data["숫자_영어"] = ['one', 'two', 'three', 'four', 'five', 'six', 'seven', 'eight', 'nine']
		common_data["10단위_숫자_영어"] = ['twenty', 'thirty', 'forty', 'fifty', 'sixty', 'seventy', 'eighty', 'ninety']
		common_data["eng_10"] = ['ten', 'eleven', 'twelve', 'thirteen', 'fourteen', 'fifteen', 'sixteen', 'eighteen', 'nineteen']
		common_data["eng_1000"] = ['thousand', 'million', 'billion', 'trillion']
		common_data["currency_eng_last"] = ['no', 'one', 'dollars']
		common_data["num_last_cent"] = ['only', 'and one cent', 'and', 'cents'],


		return common_data